#### BuiltInFailures.CuttingFailures Members

---

|  |
| --- |
| BuiltInFailures CuttingFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures CuttingFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCopyFromMultipleLinks | Elements cannot be copied from multiple links at the same time. |
| Public property Static member | ElementsWithNotCopiedParentsDeleted | Some elements were deleted because elements that they require for references were not copied. |
| Public property Static member | NoFileSaved | No file has been saved. |
| Public property Static member | NoSupported2DElementsToCopyFromView | None of the elements in the view you have selected are supported for the insert 2D operation. |
| Public property Static member | UnableToCopyElementsFromFile | Unable to copy elements from file. |
| Public property Static member | UnableToPasteToFile | Unable to paste current clipboard contents to file. |
| Public property Static member | UnableToReplaceWithLink | Selected elements were copied to new file but Revit was unable to replace them with link to that file. |

# See Also

BuiltInFailures CuttingFailures Class

Autodesk.Revit.DB Namespace